TestingTool_3-0/src/DataProcessors/УправлениеСпискомПроцессовОСWindows/УправлениеСпискомПроцессовОСWindows.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеСпискомПроцессовОСWindows</name>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПроцессов</name>
    <attributes>
      <name>Caption</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CommandLine</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CreationDate</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CSName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExecutablePath</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>OSName</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ParentProcessId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ProcessId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WindowsVersion</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Owner</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TestingTool_3-0/src/DataProcessors/УправлениеСпискомПроцессовОСWindows/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗавершитьПроцесс(Команда)
	
	
	Если Элементы.СписокПроцессов.ВыделенныеСтроки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Компьютер = Объект.Компьютер;
	Если НЕ ЗначениеЗаполнено(Компьютер) Тогда
		Компьютер = ".";
	КонецЕсли;
	
	Для каждого стр из Элементы.СписокПроцессов.ВыделенныеСтроки Цикл
		
		ТекущиеДанные = Объект.СписокПроцессов.НайтиПоИдентификатору(стр);
		
		Если ПланировщикЗаданийКлиентСервер.Computer_KillProccessByPID(Компьютер,ТекущиеДанные.ProcessId)<>0 Тогда
			Сообщить("Ошибка. "+ТекущиеДанные.Caption+" "+ТекущиеДанные.ProcessId);			
		Иначе
			Сообщить("Успешно. "+ТекущиеДанные.Caption+" "+ТекущиеДанные.ProcessId);			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ЗаполнитьСписокПроцессов();
	
	Возврат;
	
	//ТекущиеДанные = Элементы.СписокПроцессов.ТекущиеДанные;
	//Если ТекущиеДанные=Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Компьютер = Объект.Компьютер;
	//Если НЕ ЗначениеЗаполнено(Компьютер) Тогда
	//	Компьютер = ".";
	//КонецЕсли;
	//
	//Если ПланировщикЗаданийКлиентСервер.Computer_KillProccessByPID(Компьютер,ТекущиеДанные.ProcessId)<>0 Тогда
	//	Сообщить("Ошибка");
	//	ЗаполнитьСписокПроцессов();
	//Иначе
	//	Сообщить("Успешно");
	//	ЗаполнитьСписокПроцессов();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьСписокПроцессов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокПроцессов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПроцессов()
	
	Перем МассивПроцессов, стр, стр_н;
	
	Компьютер = Объект.Компьютер;
	Если НЕ ЗначениеЗаполнено(Компьютер) Тогда
		Компьютер = ".";
	КонецЕсли;
	
	МассивПроцессов = ПланировщикЗаданийКлиентСервер.Computer_SystemProcess(Компьютер);
	Объект.СписокПроцессов.Очистить();
	Для каждого стр из МассивПроцессов Цикл
		стр_н = Объект.СписокПроцессов.Добавить();
		ЗаполнитьЗначенияСвойств(стр_н,стр);
	КонецЦикла;
	
КонецПроцедуры
